# DBDocAddConn

## Description
Add a database connection to the current document

```pascal
FUNCTION DBDocAddConn(
				dsn      : DYNARRAY[] of CHAR;
				userName : DYNARRAY[] of CHAR;
				password : DYNARRAY[] of CHAR) : BOOLEAN;
```

```python

def vs.DBDocAddConn(dsn, userName, password):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dsn|DYNARRAY[] of CHAR||
|userName|DYNARRAY[] of CHAR||
|password|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* ODBC